[
  {
    "id": 2,
    "title": "Microsoft Xbox X/S Wireless Controller Robot White",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692255251854-xbox.jpg",
    "price": 57,
    "description": "Experience the modernized design of the Xbox wireless controller in robot white, featuring sculpted surfaces and refined Geometry for enhanced comfort and effortless control during gameplay\r\nStay on target with textured grip on the triggers, bumpers, and back case and with a new hybrid D-pad for accurate, yet familiar input\r\nMake the controller your own by customizing button Mapping with the Xbox accessories app",
    "brand": "microsoft",
    "model": "Xbox X/S",
    "color": "white",
    "category": "gaming",
    "popular": true,
    "discount": 4
  },
  {
    "id": 3,
    "title": "Logitech G733 Lightspeed Wireless Gaming Headset with Suspension Headband, LIGHTSYNC RGB, Blue VO!CE mic Technology and PRO-G Audio Drivers - White",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692257709689-logitech heaphone.jpg",
    "price": 384,
    "description": "Total freedom with up to 20 m wireless range and LIGHTSPEED wireless audio transmission. Keep playing for up to 29 hours of battery life. 1 Play in stereo on PlayStation(R) 4.\r\nPersonalize your headset lighting across the full spectrum, 16. 8M colors. Play in colors with front-facing, dual-zone LIGHTSYNC RGB lighting and choose from preset animations or create your own with G HUB software.\r\nColorful, reversible suspension headbands are designed for comfort during long play sessions.\r\nAdvanced mic filters that make your voice sound richer, cleaner, and more professional. Customize with G HUB and find your sound.\r\nHear every audio cue with breathtaking clarity and get immerse in your game. PRO-G drivers are designed to significantly reduce distortion and reproduce precise, consistent, rich sound quality.\r\nSoft dual-layer memory foam that conforms to your head and reduces stress points for long-lasting comfort.\r\nG733 weighs only 278 g for long-lasting comfort.",
    "brand": "logitech G",
    "model": "G733 LIGHTSPEED",
    "color": "white",
    "category": "gaming",
    "popular": true,
    "discount": 3
  },
  {
    "id": 9,
    "title": "Amkette EvoFox Elite Ops Wireless Gamepad for Android TV | Google TV | 8+ Hours of Play Time | Zero Lag Connectivity Upto 12 Feets | USB Extender for TV Included | - Dusk Grey",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694100438525-51Prg4Smx-L._SL1500_.jpg",
    "price": 18,
    "description": "The EvoFox Elite Ops Wireless Gamepad with Type C Charging is the ideal Android TV Gamepad. With all Android TVs supporting at least basic Gaming, a Gamepad at home is a must. Use the provided USB Extender Cable on your TV to ensure optimal wireless performance.\r\nThis Wireless Controller also supports Windows with X input and D input modes, and PS3s. It automatically detects and changes the gamepad mode based on your system. Simply Plug and Play!\r\nThe Elite Ops features Digital Triggers (not Analog), Accurate 360 degree concave thumbsticks, a Precise 8 way floating D-Pad. The gamepad also features dual rumble Vibration motors (for PC and PS3 only) and an easy to use Turbo Mode.\r\nThe gamepad comes with a Type C charging port and the 400mAh Rechargeable battery ensures 8 hours of non stop gameplay. The ergonomic and robust design with anti-sweat matte finish makes it easy on your hands, but tough on your enemies.",
    "brand": "Amkette",
    "model": "Woburn II Bluetooth",
    "color": "gray",
    "category": "gaming",
    "discount": 3
  },
  {
    "id": 23,
    "title": "Ant Esports GP310 Wireless Gamepad, Compatible for PC & Laptop (Windows 10/8 /7, Steam) / PS3 / Android",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692255692675-ant sport.jpg",
    "price": 14,
    "description": "Compatibility – PC / Laptop Computer(Windows 10/8/7/XP), Steam, Play Station 3(PS3), Android Mobile Phone*/Tablet*/the device needs support OTG function( * not all Android phones are supported, check your device before purchasing for Android devices, Limited games can play on it which are supported to android games)\r\nExcellent Design – Equipped with 2.4Ghz wireless technology, supports up to 10m range | Wear-resistant Anti-slip Joystick | Cool Appearance | Comfortable Grip\r\nPlug & Play -Only for PC games supporting X input mode, Android mobile games supporting Android mode, Play Station 3. No need to install drivers except for Windows XP\r\nFeature - Multi-mode : X input, D input, Android, PS3 | Vibration Feedback Function",
    "brand": "ant esports",
    "model": "GP310",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 3,
    "onSale": true
  },
  {
    "id": 24,
    "title": "Logitech G502 Lightspeed Wireless Gaming Mouse, 25K Hero Gaming Sensor, 25600 DPI, RGB, Ultra-Light, 11 Programmable Buttons, Long Life Battery, PowerPlay-Compatible, PC - Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692257315660-logitech.jpg",
    "price": 19,
    "description": "COLORFUL LIGHTSYNC RGB : Play in colour with our most vibrant LIGHTSYNC RGB featuring colour wave effects that are customisable across 16.8 million colours. 8,000 DPI sensor.\r\nCLASSIC,GAMER TESTED DESIGN : Play comfortably and with total control. The simple 6-button layout and classic gaming shape form a comfortable, time-tested and loved design\r\nMECHANICAL SPRING BUTTON TENSIONING: Primary buttons are mechanical and tensioned with durable metal springs for reliability, performance and an excellent feel\r\nCUSTOMIZABLE SETTINGS : To suit the sensitivity you like with Logitech G HUB gaming software and cycle easily through up to 5 DPI settings; SYSTEM REQUIREMENTS : Windows 7 or later, macOS 10.11 or later, Chrome OSTM, USB port, Internet access for Logitech Gaming Software (optional)\r\nStyle Name: G102 2nd Gen",
    "brand": "logitech G",
    "model": "Logitech G502",
    "color": "black",
    "category": "gaming",
    "discount": 3
  },
  {
    "id": 26,
    "title": "Handheld Game Console 5.1 inch Pro Retro Games Consoles Built-in Classic Games Rechargeable Battery Portable Style Game Consoles X12",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692458709910-51DkZC39goL._SL1000_.jpg",
    "price": 163,
    "description": "🎮900+ Selected Classic Games: This X12 game console has nostalgic 900 games, unique game file and folder list systematically, find the game you want to play by accurate original English name and number more quickly.\r\n🎮Customized Professional System: Exclusive customization console system, English default setted and Save & Load features, no more lost datas and start again, providing excellent gaming experience.\r\n🎮Quick to Go: The handheld game console with super compact size, easy to carry wherever you go on a business trip, traveling, camping, also equip with bigger battery for long playing.\r\n🎮Multimedia Gaming Device: With multifunction designing, you can reach more entertainment function like playing game, watching movie, music, TXT fiction etc.\r\n🎮Perfect Gifts for Kids & Nostalgia: This mini gaming player is a perfect companion to keep your children occupied and improve their hand-eye coordination.",
    "brand": "CredevZone",
    "model": "X12 Red&blue",
    "category": "gaming",
    "discount": 9
  },
  {
    "id": 27,
    "title": "Sony PS5 PlayStation Console+God Of War Ragnarok | Standard Edition | PS5 Game (PlayStation 5)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1692459170997-61iHq6qV0gL._SL1422_.jpg",
    "price": 708,
    "description": "Maximize your play sessions with near instant load times for installed PS5 games.\r\nThe custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible.\r\nImmerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5 games.\r\nPlay your favorite PS5 games on your stunning 4K TV.\r\nThose who break fate: Atreus seeks knowledge to help him understand the prophecy of \"Loki\" and what role he is to play in Ragnarök. Kratos must decide whether he will be chained by the fear of repeating his mistakes or break free of his past to be the father Atreus needs.",
    "brand": "sony",
    "model": "ps5",
    "category": "gaming",
    "popular": true,
    "discount": 11
  },
  {
    "id": 84,
    "title": "Acer Nitro VG240YS 23.8 Inch (60.45 Cm) IPS Full HD 1920 X 1080 Pixels, Gaming LCD Monitor with LED Backlight I AMD Freesync I 0.5 MS Response time I 165Hz Refresh Rate I Dp, 2 X Hdmi, Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694239882227-81bGoTqXEKL._SL1500_.jpg",
    "price": 137,
    "description": "Full HD: The Full HD resolution (1920 x 1080) ensures a sharp and smooth gameplay experience, even at the highest settings.VESA Mount Compatible. Viewing Angle (H/V) 178°(H)/178°(V). Brightness 250 nits (cd/m2)\r\n165 Hz refresh rate: The incredible 165 Hz refresh rate means that even when the action heats up, your gameplay will be smooth and lag-free, Visual Response Boost for blur free gaming\r\nIntegrated AMD FreeSync Premium technology eliminate screen tearing, while minimizing lag and latency and delivers very smooth gaming experiences.\r\nConnectivity Options : 2 X HDMI (2.0) 1 X Display (1.2) Ports with Inbox DP Cable I Audio Out I Integrated Stereo Speakers\r\nEye Care with Bluelight Shield, Flickerless, Low Dimming, Acer Vision Care I Acer Display Widget for Easy modification of monitor settings I Different game modes for Better viewing experience",
    "brand": "Acer",
    "model": "VG240YS",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 5
  },
  {
    "id": 85,
    "title": "Samsung 24-inch(60cm) Gaming, FHD, 165 Hz, 1 Ms, Flat Monitor, HAS, 3-Sided Borderless Display, Eye-Saver Mode, AMD FreeSync Premium, (LS24AG320NWXXL, Black)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240000483-91f6SmYBPLL._SL1500_.jpg",
    "price": 156,
    "description": "24 Inch Samsung Monitor - 1,920 x 1,080 Resolution\r\nAspect Ratio: 16:9 | 178° Horizontal and Vertical Viewing Angle\r\n3 Years Warranty From Manufacturer || Eye Saver Mode + Flicker Free - Flicker Free technology continuously removes tiring and irritating screen flicker so you can focus longer with less distraction or eye strain.",
    "brand": "samsung",
    "model": "LS24AG320NWXXL",
    "color": "black",
    "category": "gaming",
    "discount": 9
  },
  {
    "id": 86,
    "title": "ASUS Tuf - Vg259Qr Gaming 25 Inch (63.5 Cm) 1920 x 1080 Pixels LCD Monitor - Full Hd, 165Hz, 1Ms, Extreme Low Motion, Speaker, Shadow Boost, Vesa Mountable, Displayport, Hdmi Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240120607-91DXCaPOpaL._SL1500_.jpg",
    "price": 270,
    "description": "62.23cm (24.5 inch) Full HD (1920 x 1080) gaming monitor with ultrafast 165Hz refresh rate designed for professional gamers and immersive gameplay\r\nASUS Extreme Low Motion Blur (ELMB ) technology enables a 1ms response time (MPRT), eliminating ghosting for sharp gaming visuals\r\nShadow Boost enhances image details in dark areas, brightening scenes without over-exposing bright areas\r\nFeatures an ergonomically designed stand to offer extensive swivel, tilt, pivot and height adjustments",
    "brand": "asus",
    "model": "VG259QR",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 3
  },
  {
    "id": 87,
    "title": "Samsung 27-Inch(68.46Cm) 1920 x 1080 Pixels Gaming, 240Hz, 1ms, IPS, Flat Monitor, FHD, HAS, HDR10, Nvidia G-Sync Compatible, Ultrawide Game View (LS27BG400EWXXL, Black)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240213033-81z4qLkLBnL._SL1500_.jpg",
    "price": 285,
    "description": "Display 27 Inches Samsung Monitor - 1,920 x 1,080 Resolution IPS Smart Monitor\r\nIncrediby vibrant and darker blacks with 16.7 Million colors & 1000:1 contrast ratio, Refresh Rate: 240 Hz, Response Time: 1(GTG) ms\r\nFHD resolution & IPS panel\r\nEnergy-saving display: Eco Saving Plus achieves power-consumption reductions of up to 10% while still maintaining picture quality.\r\n3 Years Warranty From Manufacturer || Eye Saver Mode + Flicker Free - Flicker Free technology continuously removes tiring and irritating screen flicker so you can focus longer with less distraction or eye strain.",
    "brand": "samsung",
    "model": "LS27BG400EWXXL",
    "color": "black",
    "category": "gaming",
    "onSale": true,
    "discount": 9
  },
  {
    "id": 88,
    "title": "Samsung 43-inch(108cm) Odyssey Neo G7 UHD, 144Hz, 1 ms, Flat Gaming Monitor, Smart TV, Gaming Hub, Quantum Mini LED, HDR600, Game Bar, AMD FreeSync Premium Pro, (LS43CG700NWXXL, Black)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240302644-81t+PmgnnDL._SL1500_.jpg",
    "price": 854,
    "description": "UHD RESOLUTION: Astonishing picture quality for work and play (3840 x 2160)\r\nCoreSync & Core lighting design - With core lighting, add personality to your setup with multiple color modes that leap off the screen and into your reality and with core lighting, add personality to your setup with multiple color modes that leap off the screen and into your reality.\r\nFollow the fastest action with 144Hz refresh rate\r\nFreeSync - For exceptionally smooth, fast-action gaming.",
    "brand": "samsung",
    "model": "LS43CG700NWXXL",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 11
  },
  {
    "id": 89,
    "title": "GIGABYTE M32U 32\" 144Hz 4K FreeSync Compatible Gaming Monitor, SS IPS, 3840 x 2160 Pixels Display, 1ms Response Time (MPRT), Display Port 1.4, 2X HDMI 2.1, 3X USB 3.0, USB Type C, Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240444311-615QigQMWUL._SL1000_.jpg",
    "price": 899,
    "description": "Panel Size (diagonal) : 31.5” SS IPS, True Resolution : 3840 x 2160 (UHD)\r\nResponse Time : 1ms MPRT, Refresh Rate : 144Hz, 120Hz for Console Game*\r\nColor Saturation : 90% DCI-P3/ 123% sRGB\r\nBrightness : 350 cd/m2 (TYP), Contrast Ratio : 1000:1\r\nDisplay Colors : 10-bit (8-bit + FRC),\r\nHDR : VESA Display HDR400, HBR3 : Yes\r\nConnectivity : HDMI 2.1 (support 4K 144Hz 4:4:4 @ DSC enabled or 4K 144Hz 4:2:0) x2, Display port 1.4 (DSC) x1, USB Type-C x1\r\nUSB port(s) : USB 3.0 x3, Speaker : 3W x2, Earphone Jack : Yes\r\nUnique Features : OSD Sidekick**, Aim Stabilizer Sync, Black Equalizer, Dashboard, Crosshair, Timer, Counter, PiP/PbP, Auto-Update, KVM, 6 axis Color Control, Smart OD",
    "brand": "GIGABYTE",
    "model": "M32U",
    "color": "black",
    "category": "gaming",
    "discount": 7
  },
  {
    "id": 90,
    "title": "Xbox Series S – 1TB (Black)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240581635-61R0x6VMpdL._SL1500_.jpg",
    "price": 493,
    "description": "Experience next-gen speed and performance with Xbox Series S in Carbon Black, featuring a 1 TB SSD.\r\nMake the most of every gaming minute with Quick Resume, lightning-fast load times, and gameplay of up to 120 FPS – all powered by Xbox Velocity Architecture\r\nEnjoy digital games from four generations of Xbox, with hundreds of optimized titles that look and play better than ever\r\nGet the most out of your Xbox Series S with Xbox Game Pass Ultimate (membership sold separately) and be the first to play new games like Starfield and Forza Motorsport on day one. Plus, enjoy hundreds of games like Minecraft Legends, Halo Infinite, and Forza Horizon 5 with friends on console, PC, and cloud.\r\nWith games added all the time, there’s always something new to play.",
    "brand": "microsoft",
    "model": "xbox 5",
    "color": "black",
    "category": "gaming",
    "discount": 19
  },
  {
    "id": 91,
    "title": "ASUS RGB Gaming Wired On Ear Headset ROG Delta with Detachable Mic, Hi-Res ESS Quad-DAC, Circular RBG Lighting Effect, USB-C Connector for Pcs, Consoles, and Mobile Gaming (White)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240693670-51XXYvbE5NL._SL1000_.jpg",
    "price": 371,
    "description": "ASUS ROG Delta RGB Gaming headphone with Hi-Res ESS Quad-DAC delivers an impressive 127-db SNR for impeccably detailed & true-to-life audio that gives serious gamers a competitive edge by immersing them in powerful sound unmatched by other gaming headsets\r\nCLEAR HIGHS & PUNCHY BASS - The Delta ROG Gaming Headset feature exclusive ASUS Essence drivers with Audio Signal Diversion Technology and airtight chamber so you hear every detail with utmost precision\r\nON POINT STYLE - ROG Delta wired headphones with mic feature a classy circular rainbow RGB lighting effect that lets you set your unique style. Includes a detachable, unidirectional boom microphone with an indicative flashlight at the tip\r\nCROSS-PLATFORM COMPATIBILITY - Featuring a USB-C connector and a USB-C to USB 2.0 adapter for PC, Mac",
    "brand": "asus",
    "model": "ROG Delta White",
    "color": "white",
    "category": "gaming",
    "onSale": true,
    "discount": 9
  },
  {
    "id": 92,
    "title": "DualSense Edge Wireless Controller (PlayStation 5)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240841410-51qcJKGmDXL._SL1000_.jpg",
    "price": 198,
    "description": "Changeable stick caps, remappable inputs and custom settings make your DualSense Edge wireless controller uniquely yours. Fine tune your aim by adjusting stick sensitivity and dead zones, set the travel distance of your triggers for faster inputs, and quickly swap between control profiles so you’re always ready for your next game.\r\nSwappable back buttons can be configured to any other button input, so you’ve always got game-changing actions and essential controls at your fingertips. Plus, with two different styles of button to choose from, you can pick an input type that feels just right for your playstyle.",
    "brand": "microsoft",
    "model": "PS5 Controller",
    "color": "white",
    "category": "gaming",
    "discount": 3
  },
  {
    "id": 93,
    "title": "Xbox Elite Wireless Controller Series 2 Core – White",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694240980154-51icnF-k03L._SL1000_.jpg",
    "price": 126,
    "description": "Experience the Xbox Elite Wireless Controller Series 2 featuring adjustable-tension thumbsticks, wrap-around rubberized grip, and shorter hair trigger locks.\r\nEnjoy limitless customization with interchangeable components and exclusive button mapping options in the Xbox Accessories app.*\r\nSave up to 3 custom profiles on the controller and switch between them on the fly.; Swap thumbstick toppers, D-pads, and paddles to tailor your controller to your preferred gaming style.\r\nStay in the game with up to 40 hours of rechargeable battery life and refined components that are built to last.*\r\nWarranty Description: 90 Days Manufacturer Warranty For Manufacturer Defects; Item Length: 19.0; Power Source Type: Battery Powered; Item Height: 19.0; Item Width: 8.0",
    "brand": "microsoft",
    "model": "B0BG7F83SK",
    "color": "white",
    "category": "gaming",
    "popular": true,
    "discount": 9
  },
  {
    "id": 94,
    "title": "MSI Optix MPG321UR-QD 31.5 Inch (80.01 CM), 3840 x 2160 Pixels, 4K UHD, Gaming LCD, Monitor - Quantum Dot, IPS, 144Hz, KVM, USB, DP, HDMI, G-Sync, Gaming Intelligence, Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241085976-815WGHE6DVL._SL1500_.jpg",
    "price": 986,
    "description": "QUALITY DISPLAY: 32-inch gaming monitor with a high resolution of 3840 x 2160 px, delivering stunning 4K UHD visuals for immersive gaming & entertainment experiences. Quantum Dot technology enhances colour accuracy & vibrancy, providing a wider colour gamut & allowing for more lifelike visuals.\r\nSEAMLESS MOVEMENT: The monitor features an IPS panel for wide viewing angles and a 144Hz refresh rate, ensuring smooth and fluid motion during fast-paced gaming sessions and unlocking the full potential of premium GPU & memory hardware.\r\nG-SYNC TECHNOLOGY: This synchronises the monitor's refresh rate with compatible NVIDIA graphics cards, eliminating screen tearing and minimising stutter and input lag for a more seamless and fluid gaming experience.",
    "brand": "MSI",
    "model": "MPG321UR-QD",
    "color": "black",
    "category": "gaming",
    "onSale": true,
    "discount": 19
  },
  {
    "id": 95,
    "title": "Nitho Drive Pro V16 Racing Wheel & Pedal Set MLT-DP16-K, Compatible with PC/PS3/PS4/Xbox1/Switch",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241181380-61IxvegxZKL._SL1500_.jpg",
    "price": 144,
    "description": "The curved base can easily sit on your knees, or fix on flat table using suckers or included c-clamps if surface is not air-tight\r\nMulti-platform gaming steering wheel & pedal compatible with PC/PS3/PS4/XBOX1/Switch, for PS4 & XBOX1 you will need a data cable to link controller with the wheel\r\nRealistic full-size 26cm wheel, 27 degree turning with vibration motors, sensitivity adjustment and programming the buttons; Integrated stick shifter forward and back for immersive physical movement, F1 style paddle shifters behind the wheel for more professional driver move",
    "brand": "Nitho",
    "model": "MLT-DP16-K",
    "color": "black",
    "category": "gaming",
    "discount": 3
  },
  {
    "id": 96,
    "title": "VGRASSP Handheld Video Game Console, Retro Mini Game with 400 Classic Sup Game TV Compatible for Kids, Rechargeable 8 Bit Classic – Colour and Design as per Stock",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241320686-51qC3djhLQL.jpg",
    "price": 8,
    "description": "Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen.\r\nPerfect gift for children, retro game lovers, collectors, etc\r\nPlay Longer: 600 mAh rechargeable lithium battery, supports up to 3-4 hours of continuous game play\r\nEasy to use: Just switch on and play. Cable to connect with TV included.",
    "brand": "VGRASSP",
    "model": "‎VGRASSP_400SUPG_MFN",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 3
  },
  {
    "id": 97,
    "title": "Xbox Series X",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241552001-61-jjE67uqL._SL1500_.jpg",
    "price": 648,
    "description": "Introducing Xbox series X, the fastest, most powerful Xbox ever. Play thousands of titles from four generations of consoles—all games look and play best on Xbox series X\r\nExperience next-gen speed and performance with the Xbox velocity architecture, powered by a custom SSD and integrated software",
    "brand": "microsoft",
    "model": "B08J7QX1N1",
    "color": "black",
    "category": "gaming",
    "discount": 19
  },
  {
    "id": 98,
    "title": "ASUS Tuf Gaming Vg28Uql1A, 28 Inch (71.12 Cm) 4K Hdmi 2.1 Gaming Led Monitor 28 Inch Uhd 4K 3840 X 2160 Pixels, Fast IPS, 144Hz, Hdmi 2.1, Dsc, Free-Sync Premium, G-Sync (Black)",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241699060-71wa5QUIfRL._SL1500_.jpg",
    "price": 923,
    "description": "28-inch UHD (3840 x 2160) Fast IPS gaming monitor with 144 Hz refresh rate and 1 ms (GTG) response time, designed for professional gamers\r\nHDMI 2.1 supports native 4K 120 Hz gaming without chroma subsampling (4:4:4) on PlayStation 5 and Xbox Series X\r\nASUS Extreme Low Motion Blur Sync (ELMB Sync) technology enables ELMB and variable-refresh-rate technologies to work simultaneously to eliminate ghosting and tearing for sharp gaming visuals with high frame rates\r\nNVIDIA G-SYNC Compatible, AMD FreeSync Premium, and exclusive Variable Overdrive technology ensure seamless, tear-free gaming",
    "brand": "asus",
    "model": "Vg28Uql1A",
    "color": "black",
    "category": "gaming",
    "onSale": true,
    "discount": 15
  },
  {
    "id": 99,
    "title": "Hyperkin MegaRetroN HD Gaming Console for Genesis/ Mega Drive",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241817565-61HR+O-uUeL._SL1000_.jpg",
    "price": 221,
    "description": "Compatible with NTSC AND PAL Genesis/Mega Drive cartridges (via bottom case switch), as well as original controllers\r\n16:9/4:3 Aspect Ratio Switch and HD audio and video (720p)\r\nOne (1) \"Squire\" premium classic-style controller (10 ft. cable)\r\n6 ft. Micro cable with USB AC adapter* (we strongly advise you use a 5 Volt 1 Amp USB wall AC adapter)\r\n3 ft. HD cable and Also includes AV ports with AV cable",
    "brand": "Hyperkin",
    "model": "B07JC66GKX",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 17
  },
  {
    "id": 100,
    "title": "Logitech G PRO X Gaming Headset, Over-Ear/DTS Headphones for Esports Gaming, PC/PS/Xbox/VR/Nintendo Switch with Blue Microphones Yeti USB Mic for Recording and Streaming-Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694241938462-71TGdBS0oJL._SL1500_.jpg",
    "price": 336,
    "description": "Blue VO!CE microphone technology* – Detachable pro-grade microphone filters tune your voice in real time to sound richer, cleaner and more professional. Reduces background noise and eliminates pops and hisses for clear, consistent, in-game comms and streaming. Requires included USB external sound card, Windows PC, and Logitech G HUB software.\r\nCustom three-capsule array: This professional USB mic produces clear, powerful, broadcast-quality sound for YouTube videos, Twitch game streaming, podcasting, Zoom meetings, music recording and more.;Blue VO!CE software: Elevate your streamings and recordings with clear broadcast vocal sound and entertain your audience with enhanced effects, advanced modulation and HD audio samples.",
    "brand": "Logitech G",
    "model": "G PRO X",
    "color": "black",
    "category": "gaming",
    "discount": 9
  },
  {
    "id": 101,
    "title": "Logitech G102 USB Light Sync Gaming Mouse with Customizable RGB Lighting, 6 Programmable Buttons, Gaming Grade Sensor, 8K DPI Tracking, 16.8mn Color, Light Weight - Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694242072596-logitech 2.jpg",
    "price": 19,
    "description": "COLORFUL LIGHTSYNC RGB : Play in colour with our most vibrant LIGHTSYNC RGB featuring colour wave effects that are customisable across 16.8 million colours. 8,000 DPI sensor.\r\nCLASSIC,GAMER TESTED DESIGN : Play comfortably and with total control. The simple 6-button layout and classic gaming shape form a comfortable, time-tested and loved design\r\nMECHANICAL SPRING BUTTON TENSIONING: Primary buttons are mechanical and tensioned with durable metal springs for reliability, performance and an excellent feel",
    "brand": "Logitech G",
    "model": "G102 Lightsync",
    "color": "black",
    "category": "gaming",
    "popular": true,
    "discount": 3
  },
  {
    "id": 102,
    "title": "Ant Esports GM320 RGB Optical Wired Gaming Mouse | 8 Programmable Buttons | 12800 DPI I Ergonomic Design with Braided Cable - Black",
    "image": "https://storage.googleapis.com/fir-auth-1c3bc.appspot.com/1694242208718-51eFgb4stIL._SL1080_.jpg",
    "price": 7,
    "description": "8 programmable buttons & Fire Button - support Macro editing, 8 mouse buttons can be programmed with Ant Esports easy-to-program gaming software. The rapid Fire button gives you the edge during intensive FPS battles. Great value FPS gaming mouse, also excellent for MOBA/ RTS games.\r\nRGB backlit for extreme gaming experience- Multicolour RGB lighting, Easily turn on and off the backlit or change the color mode with the convenient switch at the bottom of the mouse. Plus, adopts impressive optical gaming sensor, ensure quickly switch for different games\r\nExcellent gaming performance with 12800 DPI and 4 polling rate- GM320 gaming mouse with default 4 DPI levels available from 1000 to 12800 DPI. Easily adjust to instantly match mouse speed to different games. polling rate is adjustable: 500Hz-1000Hz, polling rate ensures smooth and high-speed movement",
    "brand": "Ant Esports",
    "model": "GM320 RGB",
    "color": "black",
    "category": "gaming",
    "onSale": true,
    "discount": 3
  }
]